name: "ResNet-101"
layer {
  name: "input"
  type: "Input"
  top: "data"
  top: "im_info"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 224
      dim: 224
    }
    shape {
      dim: 1
      dim: 3
    }
  }
}
layer {
  name: "caffe.SpatialConvolution_0"
  type: "Convolution"
  bottom: "data"
  top: "caffe.SpatialConvolution_0"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 3
    pad_w: 3
    kernel_h: 7
    kernel_w: 7
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_1"
  type: "BN"
  bottom: "caffe.SpatialConvolution_0"
  top: "caffe.BN_1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_2"
  type: "ReLU"
  bottom: "caffe.BN_1"
  top: "caffe.BN_1"
}
layer {
  name: "caffe.Pooling_3"
  type: "Pooling"
  bottom: "caffe.BN_1"
  top: "caffe.Pooling_3"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "caffe.SpatialConvolution_4"
  type: "Convolution"
  bottom: "caffe.Pooling_3"
  top: "caffe.SpatialConvolution_4"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_5"
  type: "BN"
  bottom: "caffe.SpatialConvolution_4"
  top: "caffe.BN_5"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_6"
  type: "ReLU"
  bottom: "caffe.BN_5"
  top: "caffe.BN_5"
}
layer {
  name: "caffe.SpatialConvolution_7"
  type: "Convolution"
  bottom: "caffe.BN_5"
  top: "caffe.SpatialConvolution_7"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_8"
  type: "BN"
  bottom: "caffe.SpatialConvolution_7"
  top: "caffe.BN_8"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_9"
  type: "ReLU"
  bottom: "caffe.BN_8"
  top: "caffe.BN_8"
}
layer {
  name: "caffe.SpatialConvolution_10"
  type: "Convolution"
  bottom: "caffe.BN_8"
  top: "caffe.SpatialConvolution_10"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.SpatialConvolution_11"
  type: "Convolution"
  bottom: "caffe.Pooling_3"
  top: "caffe.SpatialConvolution_11"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_12"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_10"
  bottom: "caffe.SpatialConvolution_11"
  top: "caffe.Eltwise_12"
}
layer {
  name: "caffe.BN_13"
  type: "BN"
  bottom: "caffe.Eltwise_12"
  top: "caffe.BN_13"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_14"
  type: "ReLU"
  bottom: "caffe.BN_13"
  top: "caffe.BN_13"
}
layer {
  name: "caffe.SpatialConvolution_15"
  type: "Convolution"
  bottom: "caffe.BN_13"
  top: "caffe.SpatialConvolution_15"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_16"
  type: "BN"
  bottom: "caffe.SpatialConvolution_15"
  top: "caffe.BN_16"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_17"
  type: "ReLU"
  bottom: "caffe.BN_16"
  top: "caffe.BN_16"
}
layer {
  name: "caffe.SpatialConvolution_18"
  type: "Convolution"
  bottom: "caffe.BN_16"
  top: "caffe.SpatialConvolution_18"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_19"
  type: "BN"
  bottom: "caffe.SpatialConvolution_18"
  top: "caffe.BN_19"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_20"
  type: "ReLU"
  bottom: "caffe.BN_19"
  top: "caffe.BN_19"
}
layer {
  name: "caffe.SpatialConvolution_21"
  type: "Convolution"
  bottom: "caffe.BN_19"
  top: "caffe.SpatialConvolution_21"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_22"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_21"
  bottom: "caffe.Eltwise_12"
  top: "caffe.Eltwise_22"
}
layer {
  name: "caffe.BN_23"
  type: "BN"
  bottom: "caffe.Eltwise_22"
  top: "caffe.BN_23"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_24"
  type: "ReLU"
  bottom: "caffe.BN_23"
  top: "caffe.BN_23"
}
layer {
  name: "caffe.SpatialConvolution_25"
  type: "Convolution"
  bottom: "caffe.BN_23"
  top: "caffe.SpatialConvolution_25"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_26"
  type: "BN"
  bottom: "caffe.SpatialConvolution_25"
  top: "caffe.BN_26"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_27"
  type: "ReLU"
  bottom: "caffe.BN_26"
  top: "caffe.BN_26"
}
layer {
  name: "caffe.SpatialConvolution_28"
  type: "Convolution"
  bottom: "caffe.BN_26"
  top: "caffe.SpatialConvolution_28"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_29"
  type: "BN"
  bottom: "caffe.SpatialConvolution_28"
  top: "caffe.BN_29"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_30"
  type: "ReLU"
  bottom: "caffe.BN_29"
  top: "caffe.BN_29"
}
layer {
  name: "caffe.SpatialConvolution_31"
  type: "Convolution"
  bottom: "caffe.BN_29"
  top: "caffe.SpatialConvolution_31"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_32"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_31"
  bottom: "caffe.Eltwise_22"
  top: "caffe.Eltwise_32"
}
layer {
  name: "caffe.BN_33"
  type: "BN"
  bottom: "caffe.Eltwise_32"
  top: "caffe.BN_33"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_34"
  type: "ReLU"
  bottom: "caffe.BN_33"
  top: "caffe.BN_33"
}
layer {
  name: "caffe.SpatialConvolution_35"
  type: "Convolution"
  bottom: "caffe.BN_33"
  top: "caffe.SpatialConvolution_35"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_36"
  type: "BN"
  bottom: "caffe.SpatialConvolution_35"
  top: "caffe.BN_36"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_37"
  type: "ReLU"
  bottom: "caffe.BN_36"
  top: "caffe.BN_36"
}
layer {
  name: "caffe.SpatialConvolution_38"
  type: "Convolution"
  bottom: "caffe.BN_36"
  top: "caffe.SpatialConvolution_38"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_39"
  type: "BN"
  bottom: "caffe.SpatialConvolution_38"
  top: "caffe.BN_39"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_40"
  type: "ReLU"
  bottom: "caffe.BN_39"
  top: "caffe.BN_39"
}
layer {
  name: "caffe.SpatialConvolution_41"
  type: "Convolution"
  bottom: "caffe.BN_39"
  top: "caffe.SpatialConvolution_41"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.SpatialConvolution_42"
  type: "Convolution"
  bottom: "caffe.BN_33"
  top: "caffe.SpatialConvolution_42"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.Eltwise_43"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_41"
  bottom: "caffe.SpatialConvolution_42"
  top: "caffe.Eltwise_43"
}
layer {
  name: "caffe.BN_44"
  type: "BN"
  bottom: "caffe.Eltwise_43"
  top: "caffe.BN_44"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_45"
  type: "ReLU"
  bottom: "caffe.BN_44"
  top: "caffe.BN_44"
}
layer {
  name: "caffe.SpatialConvolution_46"
  type: "Convolution"
  bottom: "caffe.BN_44"
  top: "caffe.SpatialConvolution_46"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_47"
  type: "BN"
  bottom: "caffe.SpatialConvolution_46"
  top: "caffe.BN_47"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_48"
  type: "ReLU"
  bottom: "caffe.BN_47"
  top: "caffe.BN_47"
}
layer {
  name: "caffe.SpatialConvolution_49"
  type: "Convolution"
  bottom: "caffe.BN_47"
  top: "caffe.SpatialConvolution_49"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_50"
  type: "BN"
  bottom: "caffe.SpatialConvolution_49"
  top: "caffe.BN_50"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_51"
  type: "ReLU"
  bottom: "caffe.BN_50"
  top: "caffe.BN_50"
}
layer {
  name: "caffe.SpatialConvolution_52"
  type: "Convolution"
  bottom: "caffe.BN_50"
  top: "caffe.SpatialConvolution_52"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_53"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_52"
  bottom: "caffe.Eltwise_43"
  top: "caffe.Eltwise_53"
}
layer {
  name: "caffe.BN_54"
  type: "BN"
  bottom: "caffe.Eltwise_53"
  top: "caffe.BN_54"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_55"
  type: "ReLU"
  bottom: "caffe.BN_54"
  top: "caffe.BN_54"
}
layer {
  name: "caffe.SpatialConvolution_56"
  type: "Convolution"
  bottom: "caffe.BN_54"
  top: "caffe.SpatialConvolution_56"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_57"
  type: "BN"
  bottom: "caffe.SpatialConvolution_56"
  top: "caffe.BN_57"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_58"
  type: "ReLU"
  bottom: "caffe.BN_57"
  top: "caffe.BN_57"
}
layer {
  name: "caffe.SpatialConvolution_59"
  type: "Convolution"
  bottom: "caffe.BN_57"
  top: "caffe.SpatialConvolution_59"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_60"
  type: "BN"
  bottom: "caffe.SpatialConvolution_59"
  top: "caffe.BN_60"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_61"
  type: "ReLU"
  bottom: "caffe.BN_60"
  top: "caffe.BN_60"
}
layer {
  name: "caffe.SpatialConvolution_62"
  type: "Convolution"
  bottom: "caffe.BN_60"
  top: "caffe.SpatialConvolution_62"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_63"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_62"
  bottom: "caffe.Eltwise_53"
  top: "caffe.Eltwise_63"
}
layer {
  name: "caffe.BN_64"
  type: "BN"
  bottom: "caffe.Eltwise_63"
  top: "caffe.BN_64"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_65"
  type: "ReLU"
  bottom: "caffe.BN_64"
  top: "caffe.BN_64"
}
layer {
  name: "caffe.SpatialConvolution_66"
  type: "Convolution"
  bottom: "caffe.BN_64"
  top: "caffe.SpatialConvolution_66"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_67"
  type: "BN"
  bottom: "caffe.SpatialConvolution_66"
  top: "caffe.BN_67"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_68"
  type: "ReLU"
  bottom: "caffe.BN_67"
  top: "caffe.BN_67"
}
layer {
  name: "caffe.SpatialConvolution_69"
  type: "Convolution"
  bottom: "caffe.BN_67"
  top: "caffe.SpatialConvolution_69"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_70"
  type: "BN"
  bottom: "caffe.SpatialConvolution_69"
  top: "caffe.BN_70"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_71"
  type: "ReLU"
  bottom: "caffe.BN_70"
  top: "caffe.BN_70"
}
layer {
  name: "caffe.SpatialConvolution_72"
  type: "Convolution"
  bottom: "caffe.BN_70"
  top: "caffe.SpatialConvolution_72"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_73"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_72"
  bottom: "caffe.Eltwise_63"
  top: "caffe.Eltwise_73"
}
layer {
  name: "caffe.BN_74"
  type: "BN"
  bottom: "caffe.Eltwise_73"
  top: "caffe.BN_74"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_75"
  type: "ReLU"
  bottom: "caffe.BN_74"
  top: "caffe.BN_74"
}
layer {
  name: "caffe.SpatialConvolution_76"
  type: "Convolution"
  bottom: "caffe.BN_74"
  top: "caffe.SpatialConvolution_76"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_77"
  type: "BN"
  bottom: "caffe.SpatialConvolution_76"
  top: "caffe.BN_77"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_78"
  type: "ReLU"
  bottom: "caffe.BN_77"
  top: "caffe.BN_77"
}
layer {
  name: "caffe.SpatialConvolution_79"
  type: "Convolution"
  bottom: "caffe.BN_77"
  top: "caffe.SpatialConvolution_79"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_80"
  type: "BN"
  bottom: "caffe.SpatialConvolution_79"
  top: "caffe.BN_80"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_81"
  type: "ReLU"
  bottom: "caffe.BN_80"
  top: "caffe.BN_80"
}
layer {
  name: "caffe.SpatialConvolution_82"
  type: "Convolution"
  bottom: "caffe.BN_80"
  top: "caffe.SpatialConvolution_82"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.SpatialConvolution_83"
  type: "Convolution"
  bottom: "caffe.BN_74"
  top: "caffe.SpatialConvolution_83"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.Eltwise_84"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_82"
  bottom: "caffe.SpatialConvolution_83"
  top: "caffe.Eltwise_84"
}
layer {
  name: "caffe.BN_85"
  type: "BN"
  bottom: "caffe.Eltwise_84"
  top: "caffe.BN_85"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_86"
  type: "ReLU"
  bottom: "caffe.BN_85"
  top: "caffe.BN_85"
}
layer {
  name: "caffe.SpatialConvolution_87"
  type: "Convolution"
  bottom: "caffe.BN_85"
  top: "caffe.SpatialConvolution_87"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_88"
  type: "BN"
  bottom: "caffe.SpatialConvolution_87"
  top: "caffe.BN_88"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_89"
  type: "ReLU"
  bottom: "caffe.BN_88"
  top: "caffe.BN_88"
}
layer {
  name: "caffe.SpatialConvolution_90"
  type: "Convolution"
  bottom: "caffe.BN_88"
  top: "caffe.SpatialConvolution_90"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_91"
  type: "BN"
  bottom: "caffe.SpatialConvolution_90"
  top: "caffe.BN_91"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_92"
  type: "ReLU"
  bottom: "caffe.BN_91"
  top: "caffe.BN_91"
}
layer {
  name: "caffe.SpatialConvolution_93"
  type: "Convolution"
  bottom: "caffe.BN_91"
  top: "caffe.SpatialConvolution_93"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_94"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_93"
  bottom: "caffe.Eltwise_84"
  top: "caffe.Eltwise_94"
}
layer {
  name: "caffe.BN_95"
  type: "BN"
  bottom: "caffe.Eltwise_94"
  top: "caffe.BN_95"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_96"
  type: "ReLU"
  bottom: "caffe.BN_95"
  top: "caffe.BN_95"
}
layer {
  name: "caffe.SpatialConvolution_97"
  type: "Convolution"
  bottom: "caffe.BN_95"
  top: "caffe.SpatialConvolution_97"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_98"
  type: "BN"
  bottom: "caffe.SpatialConvolution_97"
  top: "caffe.BN_98"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_99"
  type: "ReLU"
  bottom: "caffe.BN_98"
  top: "caffe.BN_98"
}
layer {
  name: "caffe.SpatialConvolution_100"
  type: "Convolution"
  bottom: "caffe.BN_98"
  top: "caffe.SpatialConvolution_100"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_101"
  type: "BN"
  bottom: "caffe.SpatialConvolution_100"
  top: "caffe.BN_101"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_102"
  type: "ReLU"
  bottom: "caffe.BN_101"
  top: "caffe.BN_101"
}
layer {
  name: "caffe.SpatialConvolution_103"
  type: "Convolution"
  bottom: "caffe.BN_101"
  top: "caffe.SpatialConvolution_103"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_104"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_103"
  bottom: "caffe.Eltwise_94"
  top: "caffe.Eltwise_104"
}
layer {
  name: "caffe.BN_105"
  type: "BN"
  bottom: "caffe.Eltwise_104"
  top: "caffe.BN_105"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_106"
  type: "ReLU"
  bottom: "caffe.BN_105"
  top: "caffe.BN_105"
}
layer {
  name: "caffe.SpatialConvolution_107"
  type: "Convolution"
  bottom: "caffe.BN_105"
  top: "caffe.SpatialConvolution_107"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_108"
  type: "BN"
  bottom: "caffe.SpatialConvolution_107"
  top: "caffe.BN_108"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_109"
  type: "ReLU"
  bottom: "caffe.BN_108"
  top: "caffe.BN_108"
}
layer {
  name: "caffe.SpatialConvolution_110"
  type: "Convolution"
  bottom: "caffe.BN_108"
  top: "caffe.SpatialConvolution_110"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_111"
  type: "BN"
  bottom: "caffe.SpatialConvolution_110"
  top: "caffe.BN_111"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_112"
  type: "ReLU"
  bottom: "caffe.BN_111"
  top: "caffe.BN_111"
}
layer {
  name: "caffe.SpatialConvolution_113"
  type: "Convolution"
  bottom: "caffe.BN_111"
  top: "caffe.SpatialConvolution_113"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_114"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_113"
  bottom: "caffe.Eltwise_104"
  top: "caffe.Eltwise_114"
}
layer {
  name: "caffe.BN_115"
  type: "BN"
  bottom: "caffe.Eltwise_114"
  top: "caffe.BN_115"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_116"
  type: "ReLU"
  bottom: "caffe.BN_115"
  top: "caffe.BN_115"
}
layer {
  name: "caffe.SpatialConvolution_117"
  type: "Convolution"
  bottom: "caffe.BN_115"
  top: "caffe.SpatialConvolution_117"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_118"
  type: "BN"
  bottom: "caffe.SpatialConvolution_117"
  top: "caffe.BN_118"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_119"
  type: "ReLU"
  bottom: "caffe.BN_118"
  top: "caffe.BN_118"
}
layer {
  name: "caffe.SpatialConvolution_120"
  type: "Convolution"
  bottom: "caffe.BN_118"
  top: "caffe.SpatialConvolution_120"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_121"
  type: "BN"
  bottom: "caffe.SpatialConvolution_120"
  top: "caffe.BN_121"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_122"
  type: "ReLU"
  bottom: "caffe.BN_121"
  top: "caffe.BN_121"
}
layer {
  name: "caffe.SpatialConvolution_123"
  type: "Convolution"
  bottom: "caffe.BN_121"
  top: "caffe.SpatialConvolution_123"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_124"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_123"
  bottom: "caffe.Eltwise_114"
  top: "caffe.Eltwise_124"
}
layer {
  name: "caffe.BN_125"
  type: "BN"
  bottom: "caffe.Eltwise_124"
  top: "caffe.BN_125"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_126"
  type: "ReLU"
  bottom: "caffe.BN_125"
  top: "caffe.BN_125"
}
layer {
  name: "caffe.SpatialConvolution_127"
  type: "Convolution"
  bottom: "caffe.BN_125"
  top: "caffe.SpatialConvolution_127"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_128"
  type: "BN"
  bottom: "caffe.SpatialConvolution_127"
  top: "caffe.BN_128"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_129"
  type: "ReLU"
  bottom: "caffe.BN_128"
  top: "caffe.BN_128"
}
layer {
  name: "caffe.SpatialConvolution_130"
  type: "Convolution"
  bottom: "caffe.BN_128"
  top: "caffe.SpatialConvolution_130"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_131"
  type: "BN"
  bottom: "caffe.SpatialConvolution_130"
  top: "caffe.BN_131"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_132"
  type: "ReLU"
  bottom: "caffe.BN_131"
  top: "caffe.BN_131"
}
layer {
  name: "caffe.SpatialConvolution_133"
  type: "Convolution"
  bottom: "caffe.BN_131"
  top: "caffe.SpatialConvolution_133"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_134"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_133"
  bottom: "caffe.Eltwise_124"
  top: "caffe.Eltwise_134"
}
layer {
  name: "caffe.BN_135"
  type: "BN"
  bottom: "caffe.Eltwise_134"
  top: "caffe.BN_135"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_136"
  type: "ReLU"
  bottom: "caffe.BN_135"
  top: "caffe.BN_135"
}
layer {
  name: "caffe.SpatialConvolution_137"
  type: "Convolution"
  bottom: "caffe.BN_135"
  top: "caffe.SpatialConvolution_137"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_138"
  type: "BN"
  bottom: "caffe.SpatialConvolution_137"
  top: "caffe.BN_138"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_139"
  type: "ReLU"
  bottom: "caffe.BN_138"
  top: "caffe.BN_138"
}
layer {
  name: "caffe.SpatialConvolution_140"
  type: "Convolution"
  bottom: "caffe.BN_138"
  top: "caffe.SpatialConvolution_140"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_141"
  type: "BN"
  bottom: "caffe.SpatialConvolution_140"
  top: "caffe.BN_141"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_142"
  type: "ReLU"
  bottom: "caffe.BN_141"
  top: "caffe.BN_141"
}
layer {
  name: "caffe.SpatialConvolution_143"
  type: "Convolution"
  bottom: "caffe.BN_141"
  top: "caffe.SpatialConvolution_143"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_144"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_143"
  bottom: "caffe.Eltwise_134"
  top: "caffe.Eltwise_144"
}
layer {
  name: "caffe.BN_145"
  type: "BN"
  bottom: "caffe.Eltwise_144"
  top: "caffe.BN_145"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_146"
  type: "ReLU"
  bottom: "caffe.BN_145"
  top: "caffe.BN_145"
}
layer {
  name: "caffe.SpatialConvolution_147"
  type: "Convolution"
  bottom: "caffe.BN_145"
  top: "caffe.SpatialConvolution_147"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_148"
  type: "BN"
  bottom: "caffe.SpatialConvolution_147"
  top: "caffe.BN_148"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_149"
  type: "ReLU"
  bottom: "caffe.BN_148"
  top: "caffe.BN_148"
}
layer {
  name: "caffe.SpatialConvolution_150"
  type: "Convolution"
  bottom: "caffe.BN_148"
  top: "caffe.SpatialConvolution_150"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_151"
  type: "BN"
  bottom: "caffe.SpatialConvolution_150"
  top: "caffe.BN_151"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_152"
  type: "ReLU"
  bottom: "caffe.BN_151"
  top: "caffe.BN_151"
}
layer {
  name: "caffe.SpatialConvolution_153"
  type: "Convolution"
  bottom: "caffe.BN_151"
  top: "caffe.SpatialConvolution_153"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_154"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_153"
  bottom: "caffe.Eltwise_144"
  top: "caffe.Eltwise_154"
}
layer {
  name: "caffe.BN_155"
  type: "BN"
  bottom: "caffe.Eltwise_154"
  top: "caffe.BN_155"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_156"
  type: "ReLU"
  bottom: "caffe.BN_155"
  top: "caffe.BN_155"
}
layer {
  name: "caffe.SpatialConvolution_157"
  type: "Convolution"
  bottom: "caffe.BN_155"
  top: "caffe.SpatialConvolution_157"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_158"
  type: "BN"
  bottom: "caffe.SpatialConvolution_157"
  top: "caffe.BN_158"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_159"
  type: "ReLU"
  bottom: "caffe.BN_158"
  top: "caffe.BN_158"
}
layer {
  name: "caffe.SpatialConvolution_160"
  type: "Convolution"
  bottom: "caffe.BN_158"
  top: "caffe.SpatialConvolution_160"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_161"
  type: "BN"
  bottom: "caffe.SpatialConvolution_160"
  top: "caffe.BN_161"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_162"
  type: "ReLU"
  bottom: "caffe.BN_161"
  top: "caffe.BN_161"
}
layer {
  name: "caffe.SpatialConvolution_163"
  type: "Convolution"
  bottom: "caffe.BN_161"
  top: "caffe.SpatialConvolution_163"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_164"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_163"
  bottom: "caffe.Eltwise_154"
  top: "caffe.Eltwise_164"
}
layer {
  name: "caffe.BN_165"
  type: "BN"
  bottom: "caffe.Eltwise_164"
  top: "caffe.BN_165"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_166"
  type: "ReLU"
  bottom: "caffe.BN_165"
  top: "caffe.BN_165"
}
layer {
  name: "caffe.SpatialConvolution_167"
  type: "Convolution"
  bottom: "caffe.BN_165"
  top: "caffe.SpatialConvolution_167"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_168"
  type: "BN"
  bottom: "caffe.SpatialConvolution_167"
  top: "caffe.BN_168"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_169"
  type: "ReLU"
  bottom: "caffe.BN_168"
  top: "caffe.BN_168"
}
layer {
  name: "caffe.SpatialConvolution_170"
  type: "Convolution"
  bottom: "caffe.BN_168"
  top: "caffe.SpatialConvolution_170"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_171"
  type: "BN"
  bottom: "caffe.SpatialConvolution_170"
  top: "caffe.BN_171"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_172"
  type: "ReLU"
  bottom: "caffe.BN_171"
  top: "caffe.BN_171"
}
layer {
  name: "caffe.SpatialConvolution_173"
  type: "Convolution"
  bottom: "caffe.BN_171"
  top: "caffe.SpatialConvolution_173"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_174"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_173"
  bottom: "caffe.Eltwise_164"
  top: "caffe.Eltwise_174"
}
layer {
  name: "caffe.BN_175"
  type: "BN"
  bottom: "caffe.Eltwise_174"
  top: "caffe.BN_175"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_176"
  type: "ReLU"
  bottom: "caffe.BN_175"
  top: "caffe.BN_175"
}
layer {
  name: "caffe.SpatialConvolution_177"
  type: "Convolution"
  bottom: "caffe.BN_175"
  top: "caffe.SpatialConvolution_177"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_178"
  type: "BN"
  bottom: "caffe.SpatialConvolution_177"
  top: "caffe.BN_178"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_179"
  type: "ReLU"
  bottom: "caffe.BN_178"
  top: "caffe.BN_178"
}
layer {
  name: "caffe.SpatialConvolution_180"
  type: "Convolution"
  bottom: "caffe.BN_178"
  top: "caffe.SpatialConvolution_180"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_181"
  type: "BN"
  bottom: "caffe.SpatialConvolution_180"
  top: "caffe.BN_181"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_182"
  type: "ReLU"
  bottom: "caffe.BN_181"
  top: "caffe.BN_181"
}
layer {
  name: "caffe.SpatialConvolution_183"
  type: "Convolution"
  bottom: "caffe.BN_181"
  top: "caffe.SpatialConvolution_183"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_184"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_183"
  bottom: "caffe.Eltwise_174"
  top: "caffe.Eltwise_184"
}
layer {
  name: "caffe.BN_185"
  type: "BN"
  bottom: "caffe.Eltwise_184"
  top: "caffe.BN_185"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_186"
  type: "ReLU"
  bottom: "caffe.BN_185"
  top: "caffe.BN_185"
}
layer {
  name: "caffe.SpatialConvolution_187"
  type: "Convolution"
  bottom: "caffe.BN_185"
  top: "caffe.SpatialConvolution_187"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_188"
  type: "BN"
  bottom: "caffe.SpatialConvolution_187"
  top: "caffe.BN_188"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_189"
  type: "ReLU"
  bottom: "caffe.BN_188"
  top: "caffe.BN_188"
}
layer {
  name: "caffe.SpatialConvolution_190"
  type: "Convolution"
  bottom: "caffe.BN_188"
  top: "caffe.SpatialConvolution_190"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_191"
  type: "BN"
  bottom: "caffe.SpatialConvolution_190"
  top: "caffe.BN_191"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_192"
  type: "ReLU"
  bottom: "caffe.BN_191"
  top: "caffe.BN_191"
}
layer {
  name: "caffe.SpatialConvolution_193"
  type: "Convolution"
  bottom: "caffe.BN_191"
  top: "caffe.SpatialConvolution_193"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_194"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_193"
  bottom: "caffe.Eltwise_184"
  top: "caffe.Eltwise_194"
}
layer {
  name: "caffe.BN_195"
  type: "BN"
  bottom: "caffe.Eltwise_194"
  top: "caffe.BN_195"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_196"
  type: "ReLU"
  bottom: "caffe.BN_195"
  top: "caffe.BN_195"
}
layer {
  name: "caffe.SpatialConvolution_197"
  type: "Convolution"
  bottom: "caffe.BN_195"
  top: "caffe.SpatialConvolution_197"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_198"
  type: "BN"
  bottom: "caffe.SpatialConvolution_197"
  top: "caffe.BN_198"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_199"
  type: "ReLU"
  bottom: "caffe.BN_198"
  top: "caffe.BN_198"
}
layer {
  name: "caffe.SpatialConvolution_200"
  type: "Convolution"
  bottom: "caffe.BN_198"
  top: "caffe.SpatialConvolution_200"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_201"
  type: "BN"
  bottom: "caffe.SpatialConvolution_200"
  top: "caffe.BN_201"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_202"
  type: "ReLU"
  bottom: "caffe.BN_201"
  top: "caffe.BN_201"
}
layer {
  name: "caffe.SpatialConvolution_203"
  type: "Convolution"
  bottom: "caffe.BN_201"
  top: "caffe.SpatialConvolution_203"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_204"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_203"
  bottom: "caffe.Eltwise_194"
  top: "caffe.Eltwise_204"
}
layer {
  name: "caffe.BN_205"
  type: "BN"
  bottom: "caffe.Eltwise_204"
  top: "caffe.BN_205"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_206"
  type: "ReLU"
  bottom: "caffe.BN_205"
  top: "caffe.BN_205"
}
layer {
  name: "caffe.SpatialConvolution_207"
  type: "Convolution"
  bottom: "caffe.BN_205"
  top: "caffe.SpatialConvolution_207"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_208"
  type: "BN"
  bottom: "caffe.SpatialConvolution_207"
  top: "caffe.BN_208"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_209"
  type: "ReLU"
  bottom: "caffe.BN_208"
  top: "caffe.BN_208"
}
layer {
  name: "caffe.SpatialConvolution_210"
  type: "Convolution"
  bottom: "caffe.BN_208"
  top: "caffe.SpatialConvolution_210"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_211"
  type: "BN"
  bottom: "caffe.SpatialConvolution_210"
  top: "caffe.BN_211"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_212"
  type: "ReLU"
  bottom: "caffe.BN_211"
  top: "caffe.BN_211"
}
layer {
  name: "caffe.SpatialConvolution_213"
  type: "Convolution"
  bottom: "caffe.BN_211"
  top: "caffe.SpatialConvolution_213"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.Eltwise_214"
  type: "Eltwise"
  bottom: "caffe.SpatialConvolution_213"
  bottom: "caffe.Eltwise_204"
  top: "caffe.Eltwise_214"
}
layer {
  name: "caffe.BN_215"
  type: "BN"
  bottom: "caffe.Eltwise_214"
  top: "caffe.BN_215"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_216"
  type: "ReLU"
  bottom: "caffe.BN_215"
  top: "caffe.BN_215"
}
layer {
  name: "caffe.SpatialConvolution_217"
  type: "Convolution"
  bottom: "caffe.BN_215"
  top: "caffe.SpatialConvolution_217"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_218"
  type: "BN"
  bottom: "caffe.SpatialConvolution_217"
  top: "caffe.BN_218"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
    slope_filler {
      value: 1
    }
    bias_filler {
      value: 0
    }
    frozen: true
  }
}
layer {
  name: "caffe.ReLU_219"
  type: "ReLU"
  bottom: "caffe.BN_218"
  top: "caffe.BN_218"
}
layer {
  name: "caffe.SpatialConvolution_220"
  type: "Convolution"
  bottom: "caffe.BN_218"
  top: "caffe.SpatialConvolution_220"
  convolution_param {
    num_output: 256
    bias_term: false
